{
    "scenes": [
      {
        "id": 0, 
        "text": "In den Bergen um Durmstrang, verborgen in Dunkelheit und Nebel, ranken sich Gerüchte über die mächtigsten Relikte, die je existiert haben: der Schattenstein, der Seelenspiegel und der Zeitweber. Diese Artefakte könnten den Verlauf der magischen Welt verändern. Eine Prophezeiung warnt jedoch, dass ihre Macht nur Unheil bringt, wenn sie in die falschen Hände gelangen.<br><br> Du bist Lukas Roskow, ein Schüler an der magischen Schule von Durmstrang, der eines Nachts einen beunruhigenden Traum hat. Darin erscheinen dir die Relikte, ein Labyrinth und eine uralte Stimme, die dich warnt: <i>'Die Zeit läuft aus, die Dunkelheit kommt...'</i>",
        "options": [
          {
            "text": "Es beginnt...",
            "nextScene": 1
          }
        ],
        "backgroundImg": "/images/intro-background.png"
      },
      {
        "id": 1,
        "text": "Es ist eine kalte, dunkle Nacht in den Bergen um Durmstrang. Du erwachst aus einem Traum, in dem dir die drei Relikte erschienen sind. Eine uralte, tiefe Stimme hat dir zugeflüstert, dass die Zeit knapp wird. Unruhig setzt du dich auf und spürst, dass deine Reise beginnt.",
        "options": [
          {
            "text": "Wecke Levi und erzähle ihm von dem Traum.",
            "nextScene": 2
          },
          {
            "text": "Begib dich in die Bibliothek, um mehr über die Relikte zu erfahren.",
            "nextScene": 3
          },
          {
            "text": "Geh zum Hausgeist von Durmstrang, der angeblich viele Geheimnisse über die Relikte kennt.",
            "nextScene": 4
          },
          "Szene 1: Der erste Hinweis"
        ],
        "backgroundImg": "/images/scene1-background.png"
      },
      {
        "id": 2,
        "text": "Levi, dein treuer Freund und ein talentierter Runenexperte, hört dir aufmerksam zu. 'Das klingt gefährlich, Lukas', sagt er besorgt. 'Aber ich habe Gerüchte über diese Relikte gehört. Es gibt eine alte Legende, die besagt, dass sie tief in den Katakomben von Durmstrang verborgen sind. Wir müssen die verbotenen Bereiche der Schule durchsuchen.'",
        "options": [
          {
            "text": "Stimme Levi zu und macht euch auf den Weg zu den Katakomben.",
            "nextScene": 5
          },
          {
            "text": "Lehne ab und versuche, allein mehr herauszufinden, um Levi zu schützen.",
            "nextScene": 6
          },
          {
            "text": "Gehe zu Professor Korvin, dem Experten für dunkle Magie.",
            "nextScene": 7
          },
          "Option 1.1: Levi wecken"
        ],
        "backgroundImg": "/images/scene2-background.png"
      },
      {
        "id": 3,
        "text": "In der Bibliothek findest du ein altes Buch über die Heiligen Relikte. Es beschreibt den Schattenstein, den Seelenspiegel und den Zeitweber und deutet an, dass sie an geheimen Orten in Durmstrang versteckt sind.",
        "options": [
          {
            "text": "Geh zurück und erzähle Levi von dem Buch.",
            "nextScene": 2
          },
          {
            "text": "Untersuche das Buch genauer, um mehr Hinweise zu finden.",
            "nextScene": 8
          }
        ],
        "backgroundImg": "/images/scene3-background.png"
      },
      {
        "id": 4,
        "text": "Der Hausgeist von Durmstrang, ein alter Zauberer, der an die Schule gebunden ist, murmelt geheimnisvoll, dass die Relikte die Macht haben, alles zu verändern – aber nur, wenn der richtige Zauberer sie benutzt.",
        "options": [
          {
            "text": "Frage den Geist nach weiteren Details über die Relikte.",
            "nextScene": 9
          },
          {
            "text": "Verabschiede dich und gehe zurück, um Levi von der Begegnung zu berichten.",
            "nextScene": 2
          }
        ],
        "backgroundImg": "/images/scene4-background.png"
      },
      {
        "id": 5,
        "text": "Die Katakomben unter Durmstrang sind ein uraltes Labyrinth, das seit Jahrhunderten von niemandem betreten wurde. Die Luft ist kalt und modrig, und magische Schutzbarrieren flimmern in der Dunkelheit. Du und Levi steigen die steinernen Stufen hinunter und erreichen eine massive, mit Runen beschriftete Tür.",
        "options": [
          {
            "text": "Verwende den Schutzzauber, den du gelernt hast, um die Runen zu brechen.",
            "nextScene": 8
          },
          {
            "text": "Lass Levi die Runen entschlüsseln und öffne die Tür.",
            "nextScene": 9
          },
          {
            "text": "Untersuche die Katakomben weiter, um einen anderen Weg zu finden.",
            "nextScene": 10
          },
          "Szene 2: Die Katakomben von Durmstrang"
        ],
        "backgroundImg": "/images/scene5-background.png"
      },
      {
        "id": 6,
        "text": "Du versuchst, allein weiterzumachen, um Levi zu schützen. Doch die Last der Aufgabe erdrückt dich zunehmend. Ohne Levi an deiner Seite fühlst du dich verloren.",
        "options": [
          {
            "text": "Kehr zu Levi zurück und bitte ihn um Hilfe.",
            "nextScene": 2
          }
        ],
        "backgroundImg": "/images/scene2-background.png"
      },
      {
        "id": 7,
        "text": "Professor Korvin ist besorgt über deine Suche nach den Relikten. Er warnt dich, dass die Macht der Relikte verlockend, aber gefährlich ist.",
        "options": [
          {
            "text": "Bitte ihn um Rat bei der Suche nach den Relikten.",
            "nextScene": 11
          },
          {
            "text": "Ignoriere seine Warnung und setze deine Suche fort.",
            "nextScene": 5
          }
        ],
        "backgroundImg": "/images/scene7-background.png"
      },
      {
        "id": 8,
        "text": "Du findest einen weiteren Hinweis im Buch, der auf eine geheime Kammer tief unter Durmstrang hinweist.",
        "options": [
          {
            "text": "Mach dich sofort auf den Weg zu der Kammer.",
            "nextScene": 5
          },
          {
            "text": "Erzähle Levi von dem Hinweis und plant gemeinsam.",
            "nextScene": 2
          }
        ]
      },
      {
        "id": 9,
        "text": "Levi studiert die Runen genau. 'Diese Inschrift sagt: Der Schatten schützt das Relikt. Wir müssen uns in Schatten hüllen.' Levi murmelt einen Verschleierungszauber und die Tür öffnet sich. Hinter der Tür liegt ein dunkler, glänzender Stein – der Schattenstein.",
        "options": [
          {
            "text": "Greife sofort nach dem Schattenstein.",
            "nextScene": 11
          },
          {
            "text": "Untersuche die Umgebung auf Fallen oder Wächter.",
            "nextScene": 12
          },
          {
            "text": "Warne Levi davor, sich dem Relikt zu nähern.",
            "nextScene": 13
          }
        ],
        "backgroundImg": "/images/schattenstein.png"
      },
      {
        "id": 10,
        "text": "Du entscheidest, die Katakomben weiter zu erforschen. In der Dunkelheit entdeckst du eine alte Rune, die eine noch tiefere Passage öffnet.",
        "options": [
          {
            "text": "Folge der Passage.",
            "nextScene": 14
          }
        ],
        "backgroundImg": "/images/runen entschlüsseln.png"
      },
      {
        "id": 11,
        "text": "Du berührst den Schattenstein und spürst, wie eine unheilvolle Macht durch dich strömt.",
        "options": [
          {
            "text": "Akzeptiere die Macht des Schattensteins.",
            "nextScene": 15
          },
          {
            "text": "Versuche, die Verbindung zu brechen.",
            "nextScene": 16
          }
        ],
        "backgroundImg": "/images/schattenstein.png"
      },
      {
        "id": 12,
        "text": "Du untersuchst die Umgebung und entdeckst eine uralte Falle, die den Schattenstein schützen soll.",
        "options": [
          {
            "text": "Entschärfe die Falle.",
            "nextScene": 17
          }
        ]
      },
      {
        "id": 13,
        "text": "Du warnst Levi, dass etwas nicht stimmt. Er zieht sich zurück und gemeinsam untersucht ihr die Situation.",
        "options": [
          {
            "text": "Versuche, den Schattenstein zu versiegeln.",
            "nextScene": 18
          }
        ],
        "backgroundImg": "/images/schattenstein.png"
      },
      {
        "id": 14,
        "text": "Die Passage führt dich tiefer in die Katakomben. Du spürst, dass etwas Mächtiges auf dich wartet.",
        "options": [
          {
            "text": "Geh weiter.",
            "nextScene": 19
          }
        ],
        "backgroundImg": "/images/scene5-background.png"
      },
      {
        "id": 15,
        "text": "Die Macht des Schattensteins nimmt dich vollkommen ein und du spürst, wie die Dunkelheit um dich herum wächst.",
        "options": [
          {
            "text": "Setze die Reise mit der neuen Macht fort.",
            "nextScene": 20
          }
        ]
      }
    ]
  }
  